In [1]:
# To get a DataFrame we transform the dictionary to DF
import pandas as pd

dict={
    'country': ['Brazil','Russia','India','Germany','Norway'],
    'capital': ['Brasilia','Moscow','New Delhi','Berlin','Olso'],
    'area': [8.9,17.6,3.286,9.67,5.67],
    'population':[200.40,145.7,1235,56.8,80.6]
}

brics=pd.DataFrame(dict)
brics.index=['BZ','RU','In','GER','NOR']
brics

     country    capital    area  population
BZ    Brazil   Brasilia   8.900       200.4
RU    Russia     Moscow  17.600       145.7
In     India  New Delhi   3.286      1235.0
GER  Germany     Berlin   9.670        56.8
NOR   Norway       Olso   5.670        80.6

In [2]:
csv_brics=pd.read_csv('brics.csv',index_col=0)
csv_brics[0:3]

    country   capital  area  population
BR   Brazil  Brasilia   8.9       200.4
RU   Russia    Moscow  14.6       147.5
GR  Germany    Berlin   5.6        60.5

In [5]:
brics[['country','area']]

     country    area
BZ    Brazil   8.900
RU    Russia  17.600
In     India   3.286
GER  Germany   9.670
NOR   Norway   5.670

In [11]:
brics.loc[['RU'],['country']]

   country
RU  Russia

In [35]:
csv_brics.loc[['RU'],['country','area']]

   country  area
RU  Russia  14.6

In [12]:
brics.loc[['BZ','RU','In'],['country','area']]

   country    area
BZ  Brazil   8.900
RU  Russia  17.600
In   India   3.286

In [16]:
brics.loc[:,['country','area']]

     country    area
BZ    Brazil   8.900
RU    Russia  17.600
In     India   3.286
GER  Germany   9.670
NOR   Norway   5.670

In [3]:
cars=pd.read_csv('cars.csv',index_col=0)

print(cars['country'])
type(cars['country'])

US     United States
AUS        Australia
JP             Japan
IN             India
RU            Russia
MAR          Morocco
EG             Egypt
Name: country, dtype: object

pandas.core.series.Series

In [5]:
cars[['country']]

           country
US   United States
AUS      Australia
JP           Japan
IN           India
RU          Russia
MAR        Morocco
EG           Egypt

In [22]:
type(cars[['country']])

pandas.core.frame.DataFrame

In [26]:
cars['country']

US     United States
AUS        Australia
JP             Japan
IN             India
RU            Russia
MAR          Morocco
EG             Egypt
Name: country, dtype: object

In [29]:
cars[['country','drives_right']] #column access uses brackets

           country  drives_right
US   United States          True
AUS      Australia         False
JP           Japan         False
IN           India         False
RU          Russia          True
MAR        Morocco          True
EG           Egypt          True

In [30]:
cars[:] #row access using slice

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JP           Japan         False           588
IN           India         False            18
RU          Russia          True           200
MAR        Morocco          True            70
EG           Egypt          True            45

In [37]:
cars[0:5]

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JP           Japan         False           588
IN           India         False            18
RU          Russia          True           200

In [4]:
#row access using loc
#cars.loc['RU']
cars[4:5]
cars.loc[['RU']]
cars.loc[['US']]

          country  drives_right  cars_per_cap
US  United States          True           809

In [44]:
cars[['country','cars_per_cap']]

           country  cars_per_cap
US   United States           809
AUS      Australia           731
JP           Japan           588
IN           India            18
RU          Russia           200
MAR        Morocco            70
EG           Egypt            45

In [5]:
cars.loc[['US','JP'],['country']]
cars.loc[['AUS','JP'],['cars_per_cap']]

     cars_per_cap
AUS           731
JP            588

In [51]:
cars.loc[['US','MAR'],['country']]

           country
US   United States
MAR        Morocco

In [54]:
cars[1:4]

       country  drives_right  cars_per_cap
AUS  Australia         False           731
JP       Japan         False           588
IN       India         False            18

In [6]:
cars.loc[:,['country','drives_right']]

           country  drives_right
US   United States          True
AUS      Australia         False
JP           Japan         False
IN           India         False
RU          Russia          True
MAR        Morocco          True
EG           Egypt          True

In [40]:
cars.iloc[0:3,[0,1]]

           country  drives_right
US   United States          True
AUS      Australia         False
JP           Japan         False

In [8]:
cars.loc[['US','EG']]

          country  drives_right  cars_per_cap
US  United States          True           809
EG          Egypt          True            45

In [43]:
cars.loc[['US','IN','JP'],['drives_right']]

    drives_right
US          True
IN         False
JP         False

In [9]:
cars.loc[['US','EG'],['cars_per_cap']]

    cars_per_cap
US           809
EG            45

In [7]:
cars.iloc[[0,2],[1,2]]

    drives_right  cars_per_cap
US          True           809
JP         False           588

In [46]:
cars.iloc[0:3,[0,2]]

           country  cars_per_cap
US   United States           809
AUS      Australia           731
JP           Japan           588

In [8]:

cars.iloc[:,[1,2]]

     drives_right  cars_per_cap
US           True           809
AUS         False           731
JP          False           588
IN          False            18
RU           True           200
MAR          True            70
EG           True            45

In [10]:
csv_brics.iloc[0:4,[0,2]]

    country   area
BR   Brazil   8.90
RU   Russia  14.60
GR  Germany   5.60
IN    India   5.46

In [52]:
csv_brics.loc[['RU','IN'],['area']]

     area
RU  14.60
IN   5.46

In [53]:
csv_brics.iloc[:,:]

    country    capital   area  population
BR   Brazil   Brasilia   8.90       200.4
RU   Russia     Moscow  14.60       147.5
GR  Germany     Berlin   5.60        60.5
IN    India  New Delhi   5.46      1225.0
NW   Norway       Olso   5.67        80.6

In [12]:
csv_brics.loc[['RU','GR'],['country']]

    country
RU   Russia
GR  Germany

In [17]:
brics.iloc[[1,2],[0,1]]

   country    capital
RU  Russia     Moscow
In   India  New Delhi

In [19]:
brics.loc[['RU','In'],['country','capital']]

   country    capital
RU  Russia     Moscow
In   India  New Delhi

In [20]:
brics.loc[:,['area']]

       area
BZ    8.900
RU   17.600
In    3.286
GER   9.670
NOR   5.670

In [24]:
brics.iloc[[0,1],[0,2]]

   country  area
BZ  Brazil   8.9
RU  Russia  17.6

In [25]:
brics.loc[['In'],['country']]

   country
In   India

In [26]:
brics.iloc[:,:]

     country    capital    area  population
BZ    Brazil   Brasilia   8.900       200.4
RU    Russia     Moscow  17.600       145.7
In     India  New Delhi   3.286      1235.0
GER  Germany     Berlin   9.670        56.8
NOR   Norway       Olso   5.670        80.6

In [27]:
brics.loc[:,:]

     country    capital    area  population
BZ    Brazil   Brasilia   8.900       200.4
RU    Russia     Moscow  17.600       145.7
In     India  New Delhi   3.286      1235.0
GER  Germany     Berlin   9.670        56.8
NOR   Norway       Olso   5.670        80.6